import os
from dotenv import load_dotenv

load_dotenv()

# Токен бота
BOT_TOKEN = os.getenv('BOT_TOKEN', "8311335395:AAFFWfZgLGtH7C-1ES_RW4gchOCuhO7Qi-E")

# Группы
GROUPS = {
    "ж1": "Ж1",
    "ж2": "Ж2", 
    "ж3": "Ж3",
    "р1": "Р1",
    "р2": "Р2"
}

# Права доступа для кураторов (ID пользователей)
CURATORS = {
    "ж1": [665509323],  # ID куратора Ж1 (@Meep4anskiy)
    "ж2": [],            # ID куратора Ж2 (пока не назначен)
    "ж3": [1617448796],            # ID куратора Ж3 (пока не назначен)
    "р1": [1408151201], # ID куратора Р1
    "р2": [943915529]   # ID куратора Р2
}